In [1]:
import numpy as np
import pandas as pd

## Series - class

In [2]:
import random

random_lista = [random.randint(1,10) for x in range(10)]
print(random_lista)

random_series = pd.Series(random_lista)

print(random_series)

[8, 6, 5, 9, 2, 5, 7, 2, 6, 2]
0    8
1    6
2    5
3    9
4    2
5    5
6    7
7    2
8    6
9    2
dtype: int64

In [3]:
isinstance(random_series, pd.Series)

True

In [4]:
print(f'Min series minsta värde   : {random_series.min()}')
print(f'Min series maximala värde : {random_series.max()}')
print(f'Min series medelvärde     : {random_series.mean()}')

Min series minsta värde   : 2
Min series maximala värde : 9
Min series medelvärde     : 5.2

## DataFrame - class

In [5]:
#obs värdena i vår dictionary behöver INTE vara listor, du kan gott kombinera blanda annat listor, arrays & tuples

students = ('Ali', 'Amir', 'Rozann', 'Sawash')
age = [33, 0.75, 27, 3]
eye_color = np.array(['brown', 'blue', 'green', 'brown'])

min_dictionary = {'students' : students, 'age': age, 'eye color': eye_color}

min_dictionary

{'students': ('Ali', 'Amir', 'Rozann', 'Sawash'),
 'age': [33, 0.75, 27, 3],
 'eye color': array(['brown', 'blue', 'green', 'brown'], dtype='<U5')}

In [6]:
personal_df = pd.DataFrame(min_dictionary)

personal_df

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [7]:
#obs värdena i vår dictionary behöver INTE vara listor, du kan gott kombinera blanda annat listor, arrays & tuples

students = ('Ali', 'Amir', 'Rozann', 'Sawash')
age = [33, 0.75, 27, 3]
eye_color = np.array(['brown', 'blue', 'green', 'brown'])

min_dictionary = {'students' : students, 'age': age, 'eye_color': eye_color}

another_df = pd.DataFrame(min_dictionary, index=['pappa', 'son', 'mamma', 'hund'])

another_df

      students    age eye_color
pappa      Ali  33.00     brown
son       Amir   0.75      blue
mamma   Rozann  27.00     green
hund    Sawash   3.00     brown

In [8]:
personal_df

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [9]:
personal_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   students   4 non-null      object
 1   age        4 non-null      float64
 2   eye color  4 non-null      object
dtypes: float64(1), object(2)
memory usage: 228.0+ bytes

## Indexering

In [10]:
personal_df

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [11]:
personal_df['students']

0       Ali
1      Amir
2    Rozann
3    Sawash
Name: students, dtype: object

För att indexera på fler kolumner behöver dessa anges i en lista

In [12]:
personal_df[['students', 'age']]

  students    age
0      Ali  33.00
1     Amir   0.75
2   Rozann  27.00
3   Sawash   3.00

Man kan också komma åt sina kolumner genom att behandla de som attribut

In [13]:
personal_df.students

0       Ali
1      Amir
2    Rozann
3    Sawash
Name: students, dtype: object

In [14]:
personal_df['students'][0]

'Ali'

In [15]:
another_df['students']['pappa']

'Ali'

## iloc & loc

**iloc**: mer likt python idexering, som ni är vana vid

**loc**: används för att indexera specifikt på de index som finns

In [16]:
personal_df

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [17]:
personal_df.iloc[0]

students       Ali
age           33.0
eye color    brown
Name: 0, dtype: object

In [18]:
personal_df.iloc[0:2]

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue

In [19]:
personal_df.iloc[0:2]

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue

In [20]:
personal_df.iloc[:]

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [21]:
# first index is row, second index is column

personal_df.iloc[2, 2]

'green'

In [22]:
personal_df.iloc[:2, 1:3]

     age eye color
0  33.00     brown
1   0.75      blue

In [23]:
personal_df

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [24]:
personal_df.iloc[1:3, :2]

  students    age
1     Amir   0.75
2   Rozann  27.00

In [25]:
another_df

      students    age eye_color
pappa      Ali  33.00     brown
son       Amir   0.75      blue
mamma   Rozann  27.00     green
hund    Sawash   3.00     brown

In [26]:
another_df.iloc[0]

students       Ali
age           33.0
eye_color    brown
Name: pappa, dtype: object

In [27]:
another_df.iloc[0:2]

      students    age eye_color
pappa      Ali  33.00     brown
son       Amir   0.75      blue

**loc**

In [28]:
another_df

      students    age eye_color
pappa      Ali  33.00     brown
son       Amir   0.75      blue
mamma   Rozann  27.00     green
hund    Sawash   3.00     brown

In [29]:
another_df.loc['son', ['age', 'eye_color']]

age          0.75
eye_color    blue
Name: son, dtype: object

In [30]:
another_df.loc[['son','hund'], ['age', 'eye_color']]

       age eye_color
son   0.75      blue
hund  3.00     brown

In [31]:
personal_df

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [32]:
personal_df.loc[1, 'age']

0.75

In [33]:
another_df.loc['pappa':'mamma', 'age':'eye_color']

         age eye_color
pappa  33.00     brown
son     0.75      blue
mamma  27.00     green

## MASKING

In [34]:
personal_df

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [35]:
personal_df[ [False, True, False, True] ]

  students   age eye color
1     Amir  0.75      blue
3   Sawash  3.00     brown

In [36]:
personal_df[ [False, True, True, True] ]

  students    age eye color
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [37]:
personal_df

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [38]:
personal_df['age'] > 10

0     True
1    False
2     True
3    False
Name: age, dtype: bool

In [39]:
personal_df[personal_df['age'] > 10]

  students   age eye color
0      Ali  33.0     brown
2   Rozann  27.0     green

In [40]:
age_filter = personal_df['age'] > 10

personal_df[age_filter]

  students   age eye color
0      Ali  33.0     brown
2   Rozann  27.0     green

In [41]:
mature_df = personal_df[age_filter]

mature_df

  students   age eye color
0      Ali  33.0     brown
2   Rozann  27.0     green

In [42]:
personal_df[ personal_df['eye color'] == 'brown' ]

  students   age eye color
0      Ali  33.0     brown
3   Sawash   3.0     brown

In [43]:
personal_df['students']

0       Ali
1      Amir
2    Rozann
3    Sawash
Name: students, dtype: object

In [44]:
name_length_filter = [True if len(name)>4 else False for name in personal_df['students']]

In [45]:
personal_df[name_length_filter]

  students   age eye color
2   Rozann  27.0     green
3   Sawash   3.0     brown

In [46]:
s_filter = [True if name[0] == 'S' else False for name in personal_df['students']]

In [47]:
personal_df[s_filter]

  students  age eye color
3   Sawash  3.0     brown

## Read excel

In [ ]:
calories_df = pd.read_excel('../data/calories.xlsx')

calories_df

In [ ]:
# see which the unique values are

calories_df['FoodCategory'].unique()

In [ ]:
# see how many unique values this column contains

calories_df['FoodCategory'].nunique()

In [ ]:
calories_df['FoodCategory'].value_counts()

In [ ]:
calories_df.iloc[224]

In [ ]:
calories_df[calories_df['FoodCategory']=='FastFood']

# rename columns

In [ ]:
calories_df

In [ ]:
calories_df = calories_df.rename( columns={'FoodItem':'Food'} )

In [ ]:
string = '34'

int(string)

In [ ]:
calories_df['Cals_per100grams'].str[:-3].astype(int)

In [ ]:
calories_df['cals/100g in integers'] = calories_df['Cals_per100grams'].str[:-3].astype(int)

In [ ]:
calories_df.sort_values(by='cals/100g in integers', ascending=False)

In [ ]:
calories_df.head(20)

In [ ]:
calories_df.tail(20)

## Read excel with several sheets and choose header column

In [79]:
population_df = pd.read_excel('../data/komtopp50_2020.xlsx', sheet_name='Totalt', header=6)

population_df

     2020  2019    Unnamed: 2  2020.1  2019.1         %
0      83    84           Ale   31868   31402  1.483982
1      64    64      Alingsås   41602   41420  0.439401
2     123   123       Alvesta   20224   20134  0.447005
3     255   255         Aneby    6821    6848 -0.394276
4     169   167        Arboga   14039   14087 -0.340740
..    ...   ...           ...     ...     ...       ...
285    54    55     Österåker   46644   45574  2.347830
286   116   115     Östhammar   22251   22250  0.004494
287   160   159  Östra Göinge   15017   15007  0.066636
288   284   284     Överkalix    3289    3315 -0.784314
289   279   279    Övertorneå    4217    4299 -1.907420

[290 rows x 6 columns]

In [80]:
sorted_df = population_df.sort_values(by=2020, ascending=False).reset_index(drop=True)

In [81]:
sorted_df

     2020  2019 Unnamed: 2  2020.1  2019.1         %
0     290   290   Bjurholm    2387    2408 -0.872093
1     289   289    Sorsele    2442    2489 -1.888309
2     288   288    Dorotea    2498    2551 -2.077617
3     287   287   Arjeplog    2718    2785 -2.405745
4     286   286      Åsele    2805    2794  0.393701
..    ...   ...        ...     ...     ...       ...
285     5     5  Linköping  164616  163051  0.959822
286     4     4    Uppsala  233839  230767  1.331213
287     3     3      Malmö  347949  344166  1.099179
288     2     2   Göteborg  583056  579281  0.651670
289     1     1  Stockholm  975551  974073  0.151734

[290 rows x 6 columns]